In [224]:
import pandas as pd

In [225]:
# The data contains information of countries of gdp per capita vs the life expectency

# To read and show the data.

In [229]:
data = pd.read_csv(r"C:\Users\DELL\Desktop\Scaler Numpy and Pandas\gapminder.csv")

In [230]:
data

          country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

# Note - one special thing about using pandas is it also automatically assigns the index to the data set.

# what is the type of data??

In [231]:
type(data)

pandas.core.frame.DataFrame

# Accesing the particular column of the data

In [232]:
data["country"]

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: country, Length: 1704, dtype: object

In [233]:
data["continent"]

0         Asia
1         Asia
2         Asia
3         Asia
4         Asia
         ...
1699    Africa
1700    Africa
1701    Africa
1702    Africa
1703    Africa
Name: continent, Length: 1704, dtype: object

In [234]:
data["population"]

0        8425333
1        9240934
2       10267083
3       11537966
4       13079460
          ...
1699     9216418
1700    10704340
1701    11404948
1702    11926563
1703    12311143
Name: population, Length: 1704, dtype: int64

# What is the type of Column ?

In [235]:
type(data["year"])

pandas.core.series.Series

In [236]:
type(data["country"])

pandas.core.series.Series

# Note - In Numpy we do not get indexing for the array. But in the pandas every time we show the series the indexing is assigned and shown. 

# Series - series is nothing but the column.

# If you have large data set for example having very large number of columns. It will be redundant to type each and every column for the data type. To overcome that problem following snippet is used.

# Information function

In [237]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   country     1704 non-null   object
 1   year        1704 non-null   int64
 2   population  1704 non-null   int64
 3   continent   1704 non-null   object
 4   life_exp    1704 non-null   float64
 5   gdp_cap     1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

# Note - If there is no integer or floating values in the column, "Pandas" consider the data type as object(which is nothing but a string).

# describe function - Gives all the information for the entire data set

In [238]:
data.describe()

             year    population     life_exp        gdp_cap
count  1704.00000  1.704000e+03  1704.000000    1704.000000
mean   1979.50000  2.960121e+07    59.474439    7215.327081
std      17.26533  1.061579e+08    12.917107    9857.454543
min    1952.00000  6.001100e+04    23.599000     241.165876
25%    1965.75000  2.793664e+06    48.198000    1202.060309
50%    1979.50000  7.023596e+06    60.712500    3531.846988
75%    1993.25000  1.958522e+07    70.845500    9325.462346
max    2007.00000  1.318683e+09    82.603000  113523.132900

# Note - In the above we have only the integer and floating values of the data. But to get all the data types of the data set, following include is used.

In [239]:
data.describe(include = ["object" , "int64" , "float64"])

,country,year,population,continent,life_exp,gdp_cap
count,1704,1704.00000,1.704000e+03,1704,1704.000000,1704.000000
unique,142,NaN,NaN,5,NaN,NaN
top,Afghanistan,NaN,NaN,Africa,NaN,NaN
freq,12,NaN,NaN,624,NaN,NaN
mean,NaN,1979.50000,2.960121e+07,NaN,59.474439,7215.327081
std,NaN,17.26533,1.061579e+08,NaN,12.917107,9857.454543
min,NaN,1952.00000,6.001100e+04,NaN,23.599000,241.165876
25%,NaN,1965.75000,2.793664e+06,NaN,48.198000,1202.060309
50%,NaN,1979.50000,7.023596e+06,NaN,60.712500,3531.846988
75%,NaN,1993.25000,1.958522e+07,NaN,70.845500,9325.462346
max,NaN,2007.00000,1.318683e+09,NaN,82.603000,113523.132900

# head function - by default gives the first five rows

In [240]:
data.head()

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [241]:
# First 10 rows
data.head(10)

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106
5  Afghanistan  1977    14880372      Asia    38.438  786.113360
6  Afghanistan  1982    12881816      Asia    39.854  978.011439
7  Afghanistan  1987    13867957      Asia    40.822  852.395945
8  Afghanistan  1992    16317921      Asia    41.674  649.341395
9  Afghanistan  1997    22227415      Asia    41.763  635.341351

# tail function - by default gives the last 5 rows

In [242]:
data.tail()

       country  year  population continent  life_exp     gdp_cap
1699  Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700  Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701  Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702  Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703  Zimbabwe  2007    12311143    Africa    43.487  469.709298

In [243]:
#last 10 rows
data.tail(10)

       country  year  population continent  life_exp     gdp_cap
1694  Zimbabwe  1962     4277736    Africa    52.358  527.272182
1695  Zimbabwe  1967     4995432    Africa    53.995  569.795071
1696  Zimbabwe  1972     5861135    Africa    55.635  799.362176
1697  Zimbabwe  1977     6642107    Africa    57.674  685.587682
1698  Zimbabwe  1982     7636524    Africa    60.363  788.855041
1699  Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700  Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701  Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702  Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703  Zimbabwe  2007    12311143    Africa    43.487  469.709298

# shape function - gives number of columns and rows

In [244]:
data.shape

(1704, 6)

In [245]:
data.shape[0] # gives the number of rows

1704

In [246]:
data.shape[1] # gives the number of columns

6

# Accessing the columns names

In [247]:
data.columns ## Gives the names of all the columns in the data.
             ## Most of the times data.columns is used.

Index(['country', 'year', 'population', 'continent', 'life_exp', 'gdp_cap'], dtype='object')

# Note - In the above columns is an attribute so we did not use the brackets.

In [248]:
data.keys() ## Also gives the names of all the columns in the data.

Index(['country', 'year', 'population', 'continent', 'life_exp', 'gdp_cap'], dtype='object')

# Note - In the above keys is a function method. That is why we have used the brackets.

# Accesing the first five rows of the particular column.

In [249]:
data["country"].head()

0    Afghanistan
1    Afghanistan
2    Afghanistan
3    Afghanistan
4    Afghanistan
Name: country, dtype: object

# Acesss the first 50 rows of the "country" column.

In [250]:
data["country"].head(50)

0     Afghanistan
1     Afghanistan
2     Afghanistan
3     Afghanistan
4     Afghanistan
5     Afghanistan
6     Afghanistan
7     Afghanistan
8     Afghanistan
9     Afghanistan
10    Afghanistan
11    Afghanistan
12        Albania
13        Albania
14        Albania
15        Albania
16        Albania
17        Albania
18        Albania
19        Albania
20        Albania
21        Albania
22        Albania
23        Albania
24        Algeria
25        Algeria
26        Algeria
27        Algeria
28        Algeria
29        Algeria
30        Algeria
31        Algeria
32        Algeria
33        Algeria
34        Algeria
35        Algeria
36         Angola
37         Angola
38         Angola
39         Angola
40         Angola
41         Angola
42         Angola
43         Angola
44         Angola
45         Angola
46         Angola
47         Angola
48      Argentina
49      Argentina
Name: country, dtype: object

# Accesing multiple columns for the required number of rows

In [251]:
data[["country" , "year"]].head()

       country  year
0  Afghanistan  1952
1  Afghanistan  1957
2  Afghanistan  1962
3  Afghanistan  1967
4  Afghanistan  1972

# Access the first 10 rows for the columns population, continent and gdp.

In [252]:
data.head()

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [253]:
data[["population" , "continent" , "gdp_cap"]].head(10)

   population continent     gdp_cap
0     8425333      Asia  779.445314
1     9240934      Asia  820.853030
2    10267083      Asia  853.100710
3    11537966      Asia  836.197138
4    13079460      Asia  739.981106
5    14880372      Asia  786.113360
6    12881816      Asia  978.011439
7    13867957      Asia  852.395945
8    16317921      Asia  649.341395
9    22227415      Asia  635.341351

# How many unique values are there in the country column

# Unique function - Unique function gives all the unique names or values present in the column

In [254]:
data["country"].unique()

array(['Afghanistan', 'Albania', 'Algeria', 'Angola', 'Argentina',
       'Australia', 'Austria', 'Bahrain', 'Bangladesh', 'Belgium',
       'Benin', 'Bolivia', 'Bosnia and Herzegovina', 'Botswana', 'Brazil',
       'Bulgaria', 'Burkina Faso', 'Burundi', 'Cambodia', 'Cameroon',
       'Canada', 'Central African Republic', 'Chad', 'Chile', 'China',
       'Colombia', 'Comoros', 'Congo, Dem. Rep.', 'Congo, Rep.',
       'Costa Rica', "Cote d'Ivoire", 'Croatia', 'Cuba', 'Czech Republic',
       'Denmark', 'Djibouti', 'Dominican Republic', 'Ecuador', 'Egypt',
       'El Salvador', 'Equatorial Guinea', 'Eritrea', 'Ethiopia',
       'Finland', 'France', 'Gabon', 'Gambia', 'Germany', 'Ghana',
       'Greece', 'Guatemala', 'Guinea', 'Guinea-Bissau', 'Haiti',
       'Honduras', 'Hong Kong, China', 'Hungary', 'Iceland', 'India',
       'Indonesia', 'Iran', 'Iraq', 'Ireland', 'Israel', 'Italy',
       'Jamaica', 'Japan', 'Jordan', 'Kenya', 'Korea, Dem. Rep.',
       'Korea, Rep.', 'Kuwait', 'Lebanon', 'Lesotho', 'Liberia', 'Libya',
       'Madagascar', 'Malawi', 'Malaysia', 'Mali', 'Mauritania',
       'Mauritius', 'Mexico', 'Mongolia', 'Montenegro', 'Morocco',
       'Mozambique', 'Myanmar', 'Namibia', 'Nepal', 'Netherlands',
       'New Zealand', 'Nicaragua', 'Niger', 'Nigeria', 'Norway', 'Oman',
       'Pakistan', 'Panama', 'Paraguay', 'Peru', 'Philippines', 'Poland',
       'Portugal', 'Puerto Rico', 'Reunion', 'Romania', 'Rwanda',
       'Sao Tome and Principe', 'Saudi Arabia', 'Senegal', 'Serbia',
       'Sierra Leone', 'Singapore', 'Slovak Republic', 'Slovenia',
       'Somalia', 'South Africa', 'Spain', 'Sri Lanka', 'Sudan',
       'Swaziland', 'Sweden', 'Switzerland', 'Syria', 'Taiwan',
       'Tanzania', 'Thailand', 'Togo', 'Trinidad and Tobago', 'Tunisia',
       'Turkey', 'Uganda', 'United Kingdom', 'United States', 'Uruguay',
       'Venezuela', 'Vietnam', 'West Bank and Gaza', 'Yemen, Rep.',
       'Zambia', 'Zimbabwe'], dtype=object)

In [255]:
data.head(2)

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030

In [256]:
data["continent"].unique()

array(['Asia', 'Europe', 'Africa', 'Americas', 'Oceania'], dtype=object)

# nunique function - This function gives the count of all the unique valuesfor all the columns.

In [257]:
data.nunique()

country        142
year            12
population    1704
continent        5
life_exp      1626
gdp_cap       1704
dtype: int64

In [258]:
data["country"].nunique() # gives the count of unique values in the particular column.

142

# value_counts function - This funtion gives all the names and unique values of the columns

In [260]:
data["country"].value_counts()

Afghanistan          12
Pakistan             12
New Zealand          12
Nicaragua            12
Niger                12
                     ..
Eritrea              12
Equatorial Guinea    12
El Salvador          12
Egypt                12
Zimbabwe             12
Name: country, Length: 142, dtype: int64

In [88]:
data.head(2)

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030

In [89]:
data["continent"].value_counts()

Africa      624
Asia        396
Europe      360
Americas    300
Oceania      24
Name: continent, dtype: int64

In [90]:
data["year"].value_counts()

1952    142
1957    142
1962    142
1967    142
1972    142
1977    142
1982    142
1987    142
1992    142
1997    142
2002    142
2007    142
Name: year, dtype: int64

# Rename function. As the name suggests used to rename the column.

In [91]:
data.rename({"country" : "Country"} , axis = 1)

          Country  year  population continent  life_exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

# Note - The axis = 1 is provided beacuse we are performing the operations in the horizontal direction.
# Note - But the above change is not permanent because inplace = True is not provide.

In [92]:
data.head()

       country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

# so if we observe country name is not changed

In [93]:
data.rename({"country" : "Country"} , axis =1  , inplace = True) # Now the change is permanent

In [94]:
data.head()

       Country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

# Renaming the multiple columns

In [95]:
data.head()

       Country  year  population continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [96]:
data.rename({"population" : "Population" , "continent" : "Continent" , "year" : "Year"} , axis = 1 , inplace = True)

In [97]:
data.head()

       Country  Year  Population Continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

# method 2 for renaming the columns

In [98]:
data.rename(columns = {"life_exp" : "Life_Exp"})

          Country  Year  Population Continent  Life_Exp     gdp_cap
0     Afghanistan  1952     8425333      Asia    28.801  779.445314
1     Afghanistan  1957     9240934      Asia    30.332  820.853030
2     Afghanistan  1962    10267083      Asia    31.997  853.100710
3     Afghanistan  1967    11537966      Asia    34.020  836.197138
4     Afghanistan  1972    13079460      Asia    36.088  739.981106
...           ...   ...         ...       ...       ...         ...
1699     Zimbabwe  1987     9216418    Africa    62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa    60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa    46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa    39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa    43.487  469.709298

[1704 rows x 6 columns]

In [99]:
data.head()

       Country  Year  Population Continent  life_exp     gdp_cap
0  Afghanistan  1952     8425333      Asia    28.801  779.445314
1  Afghanistan  1957     9240934      Asia    30.332  820.853030
2  Afghanistan  1962    10267083      Asia    31.997  853.100710
3  Afghanistan  1967    11537966      Asia    34.020  836.197138
4  Afghanistan  1972    13079460      Asia    36.088  739.981106

In [100]:
data.rename(columns = {"life_exp" : "Life_Expl"} , inplace = True )

In [101]:
data.head()

       Country  Year  Population Continent  Life_Expl     gdp_cap
0  Afghanistan  1952     8425333      Asia     28.801  779.445314
1  Afghanistan  1957     9240934      Asia     30.332  820.853030
2  Afghanistan  1962    10267083      Asia     31.997  853.100710
3  Afghanistan  1967    11537966      Asia     34.020  836.197138
4  Afghanistan  1972    13079460      Asia     36.088  739.981106

# Deleting a column of the data set. 
# drop function

In [102]:
data.head()

       Country  Year  Population Continent  Life_Expl     gdp_cap
0  Afghanistan  1952     8425333      Asia     28.801  779.445314
1  Afghanistan  1957     9240934      Asia     30.332  820.853030
2  Afghanistan  1962    10267083      Asia     31.997  853.100710
3  Afghanistan  1967    11537966      Asia     34.020  836.197138
4  Afghanistan  1972    13079460      Asia     36.088  739.981106

In [103]:
data.drop("Continent" , axis = 1)

          Country  Year  Population  Life_Expl     gdp_cap
0     Afghanistan  1952     8425333     28.801  779.445314
1     Afghanistan  1957     9240934     30.332  820.853030
2     Afghanistan  1962    10267083     31.997  853.100710
3     Afghanistan  1967    11537966     34.020  836.197138
4     Afghanistan  1972    13079460     36.088  739.981106
...           ...   ...         ...        ...         ...
1699     Zimbabwe  1987     9216418     62.351  706.157306
1700     Zimbabwe  1992    10704340     60.377  693.420786
1701     Zimbabwe  1997    11404948     46.809  792.449960
1702     Zimbabwe  2002    11926563     39.989  672.038623
1703     Zimbabwe  2007    12311143     43.487  469.709298

[1704 rows x 5 columns]

# Note - The above is a temporary change, as we did not provide the inplace = True.

In [104]:
data.head()

       Country  Year  Population Continent  Life_Expl     gdp_cap
0  Afghanistan  1952     8425333      Asia     28.801  779.445314
1  Afghanistan  1957     9240934      Asia     30.332  820.853030
2  Afghanistan  1962    10267083      Asia     31.997  853.100710
3  Afghanistan  1967    11537966      Asia     34.020  836.197138
4  Afghanistan  1972    13079460      Asia     36.088  739.981106

# Drop multiple columns

In [105]:
data.head()

       Country  Year  Population Continent  Life_Expl     gdp_cap
0  Afghanistan  1952     8425333      Asia     28.801  779.445314
1  Afghanistan  1957     9240934      Asia     30.332  820.853030
2  Afghanistan  1962    10267083      Asia     31.997  853.100710
3  Afghanistan  1967    11537966      Asia     34.020  836.197138
4  Afghanistan  1972    13079460      Asia     36.088  739.981106

In [106]:
data.drop(["Year" , "Continent" , "Population"] , axis = 1 )

          Country  Life_Expl     gdp_cap
0     Afghanistan     28.801  779.445314
1     Afghanistan     30.332  820.853030
2     Afghanistan     31.997  853.100710
3     Afghanistan     34.020  836.197138
4     Afghanistan     36.088  739.981106
...           ...        ...         ...
1699     Zimbabwe     62.351  706.157306
1700     Zimbabwe     60.377  693.420786
1701     Zimbabwe     46.809  792.449960
1702     Zimbabwe     39.989  672.038623
1703     Zimbabwe     43.487  469.709298

[1704 rows x 3 columns]

# But the change is still temporary as inplace = True is not provided.

In [107]:
data.head()

       Country  Year  Population Continent  Life_Expl     gdp_cap
0  Afghanistan  1952     8425333      Asia     28.801  779.445314
1  Afghanistan  1957     9240934      Asia     30.332  820.853030
2  Afghanistan  1962    10267083      Asia     31.997  853.100710
3  Afghanistan  1967    11537966      Asia     34.020  836.197138
4  Afghanistan  1972    13079460      Asia     36.088  739.981106

# Adding a column

# For example add a new column where the values are year+7

In [108]:
data.head()

       Country  Year  Population Continent  Life_Expl     gdp_cap
0  Afghanistan  1952     8425333      Asia     28.801  779.445314
1  Afghanistan  1957     9240934      Asia     30.332  820.853030
2  Afghanistan  1962    10267083      Asia     31.997  853.100710
3  Afghanistan  1967    11537966      Asia     34.020  836.197138
4  Afghanistan  1972    13079460      Asia     36.088  739.981106

In [109]:
data["Year + 7"] = data["Year"] + 7

In [110]:
data.head()

       Country  Year  Population Continent  Life_Expl     gdp_cap  Year + 7
0  Afghanistan  1952     8425333      Asia     28.801  779.445314      1959
1  Afghanistan  1957     9240934      Asia     30.332  820.853030      1964
2  Afghanistan  1962    10267083      Asia     31.997  853.100710      1969
3  Afghanistan  1967    11537966      Asia     34.020  836.197138      1974
4  Afghanistan  1972    13079460      Asia     36.088  739.981106      1979

# Create a column of life expectency + Year

In [111]:
data["life+year"] = data["Life_Expl"] + data["Year"]

In [112]:
data.head()

,Country,Year,Population,Continent,Life_Expl,gdp_cap,Year + 7,life+year
0,Afghanistan,1952,8425333,Asia,28.801,779.445314,1959,1980.801
1,Afghanistan,1957,9240934,Asia,30.332,820.853030,1964,1987.332
2,Afghanistan,1962,10267083,Asia,31.997,853.100710,1969,1993.997
3,Afghanistan,1967,11537966,Asia,34.020,836.197138,1974,2001.020
4,Afghanistan,1972,13079460,Asia,36.088,739.981106,1979,2008.088

In [113]:
data.head()

,Country,Year,Population,Continent,Life_Expl,gdp_cap,Year + 7,life+year
0,Afghanistan,1952,8425333,Asia,28.801,779.445314,1959,1980.801
1,Afghanistan,1957,9240934,Asia,30.332,820.853030,1964,1987.332
2,Afghanistan,1962,10267083,Asia,31.997,853.100710,1969,1993.997
3,Afghanistan,1967,11537966,Asia,34.020,836.197138,1974,2001.020
4,Afghanistan,1972,13079460,Asia,36.088,739.981106,1979,2008.088

# Deleting the rows from the data set

In [114]:
data.head(10)

,Country,Year,Population,Continent,Life_Expl,gdp_cap,Year + 7,life+year
0,Afghanistan,1952,8425333,Asia,28.801,779.445314,1959,1980.801
1,Afghanistan,1957,9240934,Asia,30.332,820.853030,1964,1987.332
2,Afghanistan,1962,10267083,Asia,31.997,853.100710,1969,1993.997
3,Afghanistan,1967,11537966,Asia,34.020,836.197138,1974,2001.020
4,Afghanistan,1972,13079460,Asia,36.088,739.981106,1979,2008.088
5,Afghanistan,1977,14880372,Asia,38.438,786.113360,1984,2015.438
6,Afghanistan,1982,12881816,Asia,39.854,978.011439,1989,2021.854
7,Afghanistan,1987,13867957,Asia,40.822,852.395945,1994,2027.822
8,Afghanistan,1992,16317921,Asia,41.674,649.341395,1999,2033.674
9,Afghanistan,1997,22227415,Asia,41.763,635.341351,2004,2038.763

In [115]:
data.drop([1,2,4])

,Country,Year,Population,Continent,Life_Expl,gdp_cap,Year + 7,life+year
0,Afghanistan,1952,8425333,Asia,28.801,779.445314,1959,1980.801
3,Afghanistan,1967,11537966,Asia,34.020,836.197138,1974,2001.020
5,Afghanistan,1977,14880372,Asia,38.438,786.113360,1984,2015.438
6,Afghanistan,1982,12881816,Asia,39.854,978.011439,1989,2021.854
7,Afghanistan,1987,13867957,Asia,40.822,852.395945,1994,2027.822
...,...,...,...,...,...,...,...,...
1699,Zimbabwe,1987,9216418,Africa,62.351,706.157306,1994,2049.351
1700,Zimbabwe,1992,10704340,Africa,60.377,693.420786,1999,2052.377
1701,Zimbabwe,1997,11404948,Africa,46.809,792.449960,2004,2043.809
1702,Zimbabwe,2002,11926563,Africa,39.989,672.038623,2009,2041.989
1703,Zimbabwe,2007,12311143,Africa,43.487,469.709298,2014,2050.487

# so as we see in the above the rows 1,2,4 are deleted from the data set

# Delete the extra columns that were added earlier

In [116]:
data.head()

,Country,Year,Population,Continent,Life_Expl,gdp_cap,Year + 7,life+year
0,Afghanistan,1952,8425333,Asia,28.801,779.445314,1959,1980.801
1,Afghanistan,1957,9240934,Asia,30.332,820.853030,1964,1987.332
2,Afghanistan,1962,10267083,Asia,31.997,853.100710,1969,1993.997
3,Afghanistan,1967,11537966,Asia,34.020,836.197138,1974,2001.020
4,Afghanistan,1972,13079460,Asia,36.088,739.981106,1979,2008.088

In [117]:
data.drop(["Year + 7" , "life+year"], axis = 1 , inplace = True )

In [118]:
data.head()

       Country  Year  Population Continent  Life_Expl     gdp_cap
0  Afghanistan  1952     8425333      Asia     28.801  779.445314
1  Afghanistan  1957     9240934      Asia     30.332  820.853030
2  Afghanistan  1962    10267083      Asia     31.997  853.100710
3  Afghanistan  1967    11537966      Asia     34.020  836.197138
4  Afghanistan  1972    13079460      Asia     36.088  739.981106

# Part 2

# Working on particular series and accessing the index

In [119]:
data.head()

       Country  Year  Population Continent  Life_Expl     gdp_cap
0  Afghanistan  1952     8425333      Asia     28.801  779.445314
1  Afghanistan  1957     9240934      Asia     30.332  820.853030
2  Afghanistan  1962    10267083      Asia     31.997  853.100710
3  Afghanistan  1967    11537966      Asia     34.020  836.197138
4  Afghanistan  1972    13079460      Asia     36.088  739.981106

In [120]:
ser = data["Country"]

In [121]:
ser

0       Afghanistan
1       Afghanistan
2       Afghanistan
3       Afghanistan
4       Afghanistan
           ...
1699       Zimbabwe
1700       Zimbabwe
1701       Zimbabwe
1702       Zimbabwe
1703       Zimbabwe
Name: Country, Length: 1704, dtype: object

In [122]:
ser[8]

'Afghanistan'

# Data Slicing

In [123]:
ser[10:20]

10    Afghanistan
11    Afghanistan
12        Albania
13        Albania
14        Albania
15        Albania
16        Albania
17        Albania
18        Albania
19        Albania
Name: Country, dtype: object

In [124]:
ser.index

RangeIndex(start=0, stop=1704, step=1)

In [125]:
import numpy as np

In [126]:
ser.index = np.arange(5,1709)

In [127]:
ser

5       Afghanistan
6       Afghanistan
7       Afghanistan
8       Afghanistan
9       Afghanistan
           ...
1704       Zimbabwe
1705       Zimbabwe
1706       Zimbabwe
1707       Zimbabwe
1708       Zimbabwe
Name: Country, Length: 1704, dtype: object

In [128]:
ser[9]

'Afghanistan'

# Creating series using pandas

In [129]:
data1 = pd.Series(["a" , "b" , "c" , "d" , "e" , "f" , "g" , "h" , "i"])

In [130]:
data1

0    a
1    b
2    c
3    d
4    e
5    f
6    g
7    h
8    i
dtype: object

In [131]:
data2 = pd.Series(["a" , "b" , "c" , "d" , "e" , "f" , "g" , "h" , "i"] , index = [1,2,3,4,5,6,7,8,9])

In [132]:
data2

1    a
2    b
3    c
4    d
5    e
6    f
7    g
8    h
9    i
dtype: object

# We can also give floating point numbers and strings as the index in the above

In [133]:
data3 = pd.Series(["a" , "b" , "c" , "d" , "e" , "f" , "g" , "h" , "i"] , index = [1.1,2.2,3.3,4.4,5.5,6.6,7.7,8.8,9.9])

In [134]:
data3

1.1    a
2.2    b
3.3    c
4.4    d
5.5    e
6.6    f
7.7    g
8.8    h
9.9    i
dtype: object

In [135]:
data4 = pd.Series(["a" , "b" , "c" , "d" , "e" , "f" , "g" , "h" , "i"] , index = ["a","b","c","d","e","f","g","h","i"])

In [136]:
data4

a    a
b    b
c    c
d    d
e    e
f    f
g    g
h    h
i    i
dtype: object

In [137]:
data4["a"]

'a'

# Note - The length of values and length of indices should match. else it throws an error

In [138]:
data5 = pd.Series(["a" , "b" , "c" , "d" , "e" , "f" , "g" , "h" , "i"] , index = [1,2,3,4,5,6,7,8])

ValueError: Length of values (9) does not match length of index (8)

In [139]:
data2

1    a
2    b
3    c
4    d
5    e
6    f
7    g
8    h
9    i
dtype: object

In [140]:
data2[3] ## indexing

'c'

In [141]:
data2[3:6] ##slicing

4    d
5    e
6    f
dtype: object

# Note - According to the logic we should be getting the values as c,d,e after slicing. But id did not happen.

# Reason.
This happened because we have provided explicit indexing but when slicing operation is performed, Python by default take the implicit indexing (0 based indexing)

# Note - To overcome this problem there is a concept of "loc" and "iloc"

# iloc and loc functions

In [142]:
# data2.loc[] ## loc takes the explicit index(indices given by us)
# data2.iloc[] ## iloc takes the implicit index(indices bydefault(0 based indices)

In [143]:
data2

1    a
2    b
3    c
4    d
5    e
6    f
7    g
8    h
9    i
dtype: object

In [144]:
data2.iloc[5]

'f'

In [145]:
data2.loc[5]

'e'

In [146]:
data2.iloc[5:8]

6    f
7    g
8    h
dtype: object

# Note - we used iloc in above as we want to use the implicit indices for slicing

In [147]:
data2

1    a
2    b
3    c
4    d
5    e
6    f
7    g
8    h
9    i
dtype: object

In [148]:
data2.loc[3:7]

3    c
4    d
5    e
6    f
7    g
dtype: object

In [149]:
# Note - We used "loc" in the above because we are using the indices explicitly for slicing.

In [150]:
data2.loc[3] # loc function is used for explicit indexing

'c'

In [151]:
data2.iloc[3] # iloc function is used for impilicit indexing.

'd'

# Note - when loc function is used for explicit indexing, the last value is included in the slicing.

In [152]:
data4

a    a
b    b
c    c
d    d
e    e
f    f
g    g
h    h
i    i
dtype: object

In [153]:
data4.iloc[4] # implicit indexing using iloc

'e'

In [154]:
data4.iloc[4:7] # implicit index slicing using iloc

e    e
f    f
g    g
dtype: object

In [155]:
data4.loc["e"]

'e'

In [156]:
data4.loc["e":"g"]

e    e
f    f
g    g
dtype: object

# Accessing the multiple values in the data

In [157]:
# Access c, f and i from the above data

In [158]:
data4

a    a
b    b
c    c
d    d
e    e
f    f
g    g
h    h
i    i
dtype: object

# Access c,f and i values from the above data

In [159]:
data4.loc[["c" , "f" , "i"]]

c    c
f    f
i    i
dtype: object

# Now working on the data set with "iloc" and "loc"

In [160]:
data.head()

       Country  Year  Population Continent  Life_Expl     gdp_cap
0  Afghanistan  1952     8425333      Asia     28.801  779.445314
1  Afghanistan  1957     9240934      Asia     30.332  820.853030
2  Afghanistan  1962    10267083      Asia     31.997  853.100710
3  Afghanistan  1967    11537966      Asia     34.020  836.197138
4  Afghanistan  1972    13079460      Asia     36.088  739.981106

In [161]:
data.loc[1]

Country       Afghanistan
Year                 1957
Population        9240934
Continent            Asia
Life_Expl          30.332
gdp_cap         820.85303
Name: 1, dtype: object

In [162]:
data.iloc[1]

Country       Afghanistan
Year                 1957
Population        9240934
Continent            Asia
Life_Expl          30.332
gdp_cap         820.85303
Name: 1, dtype: object

# Note - From the above as the the implicit(0 based default indices) and explicit(indices assigned by us) are same "iloc" and "loc" gives the same output.

In [163]:
data.loc[3:5]

       Country  Year  Population Continent  Life_Expl     gdp_cap
3  Afghanistan  1967    11537966      Asia     34.020  836.197138
4  Afghanistan  1972    13079460      Asia     36.088  739.981106
5  Afghanistan  1977    14880372      Asia     38.438  786.113360

In [164]:
data.iloc[3:5]

       Country  Year  Population Continent  Life_Expl     gdp_cap
3  Afghanistan  1967    11537966      Asia     34.020  836.197138
4  Afghanistan  1972    13079460      Asia     36.088  739.981106

# Note - From the above slicing, loc(explicit indices) gives the rows of 3,4,5 and iloc slicing gives the rows of only 3 and 4 as the 5 is excluded because of implicit indexing.

# Accesing the particular rows of the data using "loc"

In [165]:
data.loc[[1,10,100,125,150]]

,Country,Year,Population,Continent,Life_Expl,gdp_cap
1,Afghanistan,1957,9240934,Asia,30.332,820.853030
10,Afghanistan,2002,25268405,Asia,42.129,726.734055
100,Bangladesh,1972,70759295,Asia,45.252,630.233627
125,Benin,1977,3168267,Africa,49.190,1029.161251
150,Bosnia and Herzegovina,1982,4172693,Europe,70.690,4126.613157

# Accesing particular rows and particular columns using "loc"

In [166]:
data.head()

       Country  Year  Population Continent  Life_Expl     gdp_cap
0  Afghanistan  1952     8425333      Asia     28.801  779.445314
1  Afghanistan  1957     9240934      Asia     30.332  820.853030
2  Afghanistan  1962    10267083      Asia     31.997  853.100710
3  Afghanistan  1967    11537966      Asia     34.020  836.197138
4  Afghanistan  1972    13079460      Asia     36.088  739.981106

In [167]:
# Access the rows 10,20,100 for the columns Continent to gdp.

In [168]:
data.loc[[10,20,100] , "Continent" : "gdp_cap"]  # slicing

    Continent  Life_Expl      gdp_cap
10       Asia     42.129   726.734055
20     Europe     71.581  2497.437901
100      Asia     45.252   630.233627

# Access the rows 10,20,100 for the columns country , continent , gdp

In [169]:
data.loc[[10,20,200] , ["Country" , "Continent" , "gdp_cap"]] # Listing the required columns.

          Country Continent      gdp_cap
10    Afghanistan      Asia   726.734055
20        Albania    Europe  2497.437901
200  Burkina Faso    Africa   931.752773

In [170]:
# Access the rows 10,20,100 for the columns country , gdp and population in the same format

In [171]:
data.head()

       Country  Year  Population Continent  Life_Expl     gdp_cap
0  Afghanistan  1952     8425333      Asia     28.801  779.445314
1  Afghanistan  1957     9240934      Asia     30.332  820.853030
2  Afghanistan  1962    10267083      Asia     31.997  853.100710
3  Afghanistan  1967    11537966      Asia     34.020  836.197138
4  Afghanistan  1972    13079460      Asia     36.088  739.981106

In [172]:
data.loc[[10,20,200] , ["Country" , "gdp_cap" , "Population"]]

          Country      gdp_cap  Population
10    Afghanistan   726.734055    25268405
20        Albania  2497.437901     3326498
200  Burkina Faso   931.752773     8878303

# Accesing particular rows of the data using "iloc"

# Access the rows 10,20,100 and 125 using "iloc"

In [173]:
data.iloc[[10,20,100,125]]

         Country  Year  Population Continent  Life_Expl      gdp_cap
10   Afghanistan  2002    25268405      Asia     42.129   726.734055
20       Albania  1992     3326498    Europe     71.581  2497.437901
100   Bangladesh  1972    70759295      Asia     45.252   630.233627
125        Benin  1977     3168267    Africa     49.190  1029.161251

# Accesing particular rows and particular columns using "iloc"

In [174]:
# Access the rows 10,20,100 for the columns population to gdp.

In [175]:
data.head()

       Country  Year  Population Continent  Life_Expl     gdp_cap
0  Afghanistan  1952     8425333      Asia     28.801  779.445314
1  Afghanistan  1957     9240934      Asia     30.332  820.853030
2  Afghanistan  1962    10267083      Asia     31.997  853.100710
3  Afghanistan  1967    11537966      Asia     34.020  836.197138
4  Afghanistan  1972    13079460      Asia     36.088  739.981106

In [176]:
data.iloc[[10,20,100] , 2:]

     Population Continent  Life_Expl      gdp_cap
10     25268405      Asia     42.129   726.734055
20      3326498    Europe     71.581  2497.437901
100    70759295      Asia     45.252   630.233627

# Note - In the above as we are using the iloc(implicit indexing) we cannot do the slicing of columns using strings

# Accesing particular rows and particular columns using "iloc"

# Access the rows 10,20,100 for the columns country , continent , gdp

In [177]:
data.head()

       Country  Year  Population Continent  Life_Expl     gdp_cap
0  Afghanistan  1952     8425333      Asia     28.801  779.445314
1  Afghanistan  1957     9240934      Asia     30.332  820.853030
2  Afghanistan  1962    10267083      Asia     31.997  853.100710
3  Afghanistan  1967    11537966      Asia     34.020  836.197138
4  Afghanistan  1972    13079460      Asia     36.088  739.981106

In [178]:
data.iloc[[10,20,100] , [0,3,5]]

         Country Continent      gdp_cap
10   Afghanistan      Asia   726.734055
20       Albania    Europe  2497.437901
100   Bangladesh      Asia   630.233627

In [179]:
# Access the rows 10,20,100 for the columns continent, country and gdp in the same order.

In [180]:
data.head()

       Country  Year  Population Continent  Life_Expl     gdp_cap
0  Afghanistan  1952     8425333      Asia     28.801  779.445314
1  Afghanistan  1957     9240934      Asia     30.332  820.853030
2  Afghanistan  1962    10267083      Asia     31.997  853.100710
3  Afghanistan  1967    11537966      Asia     34.020  836.197138
4  Afghanistan  1972    13079460      Asia     36.088  739.981106

In [181]:
data.iloc[[10,20,100] , [3,0,5]]

    Continent      Country      gdp_cap
10       Asia  Afghanistan   726.734055
20     Europe      Albania  2497.437901
100      Asia   Bangladesh   630.233627

# Setting a certain column as an index for the data set

In [182]:
temp = data.set_index("Population")

In [183]:
temp

                Country  Year Continent  Life_Expl     gdp_cap
Population
8425333     Afghanistan  1952      Asia     28.801  779.445314
9240934     Afghanistan  1957      Asia     30.332  820.853030
10267083    Afghanistan  1962      Asia     31.997  853.100710
11537966    Afghanistan  1967      Asia     34.020  836.197138
13079460    Afghanistan  1972      Asia     36.088  739.981106
...                 ...   ...       ...        ...         ...
9216418        Zimbabwe  1987    Africa     62.351  706.157306
10704340       Zimbabwe  1992    Africa     60.377  693.420786
11404948       Zimbabwe  1997    Africa     46.809  792.449960
11926563       Zimbabwe  2002    Africa     39.989  672.038623
12311143       Zimbabwe  2007    Africa     43.487  469.709298

[1704 rows x 5 columns]

In [184]:
data.head()

       Country  Year  Population Continent  Life_Expl     gdp_cap
0  Afghanistan  1952     8425333      Asia     28.801  779.445314
1  Afghanistan  1957     9240934      Asia     30.332  820.853030
2  Afghanistan  1962    10267083      Asia     31.997  853.100710
3  Afghanistan  1967    11537966      Asia     34.020  836.197138
4  Afghanistan  1972    13079460      Asia     36.088  739.981106

In [185]:
temp.head()

                Country  Year Continent  Life_Expl     gdp_cap
Population
8425333     Afghanistan  1952      Asia     28.801  779.445314
9240934     Afghanistan  1957      Asia     30.332  820.853030
10267083    Afghanistan  1962      Asia     31.997  853.100710
11537966    Afghanistan  1967      Asia     34.020  836.197138
13079460    Afghanistan  1972      Asia     36.088  739.981106

# Assignments

In [186]:
data.head(5)

       Country  Year  Population Continent  Life_Expl     gdp_cap
0  Afghanistan  1952     8425333      Asia     28.801  779.445314
1  Afghanistan  1957     9240934      Asia     30.332  820.853030
2  Afghanistan  1962    10267083      Asia     31.997  853.100710
3  Afghanistan  1967    11537966      Asia     34.020  836.197138
4  Afghanistan  1972    13079460      Asia     36.088  739.981106

In [198]:
pop_new = data[data["Population"] > 10000000]

In [200]:
pop_new

          Country  Year  Population Continent  Life_Expl      gdp_cap
2     Afghanistan  1962    10267083      Asia     31.997   853.100710
3     Afghanistan  1967    11537966      Asia     34.020   836.197138
4     Afghanistan  1972    13079460      Asia     36.088   739.981106
5     Afghanistan  1977    14880372      Asia     38.438   786.113360
6     Afghanistan  1982    12881816      Asia     39.854   978.011439
...           ...   ...         ...       ...        ...          ...
1691       Zambia  2007    11746035    Africa     42.384  1271.211593
1700     Zimbabwe  1992    10704340    Africa     60.377   693.420786
1701     Zimbabwe  1997    11404948    Africa     46.809   792.449960
1702     Zimbabwe  2002    11926563    Africa     39.989   672.038623
1703     Zimbabwe  2007    12311143    Africa     43.487   469.709298

[659 rows x 6 columns]

In [204]:
data.sort_values(["Year" , "Population"])

,Country,Year,Population,Continent,Life_Expl,gdp_cap
1296,Sao Tome and Principe,1952,60011,Africa,46.471,879.583586
420,Djibouti,1952,63149,Africa,34.812,2669.529475
84,Bahrain,1952,120447,Asia,50.939,9867.084765
684,Iceland,1952,147962,Europe,72.490,7267.688428
312,Comoros,1952,153936,Africa,40.715,1102.990936
...,...,...,...,...,...,...
179,Brazil,2007,190010647,Americas,72.390,9065.800825
719,Indonesia,2007,223547000,Asia,70.650,3540.651564
1619,United States,2007,301139947,Americas,78.242,42951.653090
707,India,2007,1110396331,Asia,64.698,2452.210407
299,China,2007,1318683096,Asia,72.961,4959.114854

In [206]:
data

          Country  Year  Population Continent  Life_Expl     gdp_cap
0     Afghanistan  1952     8425333      Asia     28.801  779.445314
1     Afghanistan  1957     9240934      Asia     30.332  820.853030
2     Afghanistan  1962    10267083      Asia     31.997  853.100710
3     Afghanistan  1967    11537966      Asia     34.020  836.197138
4     Afghanistan  1972    13079460      Asia     36.088  739.981106
...           ...   ...         ...       ...        ...         ...
1699     Zimbabwe  1987     9216418    Africa     62.351  706.157306
1700     Zimbabwe  1992    10704340    Africa     60.377  693.420786
1701     Zimbabwe  1997    11404948    Africa     46.809  792.449960
1702     Zimbabwe  2002    11926563    Africa     39.989  672.038623
1703     Zimbabwe  2007    12311143    Africa     43.487  469.709298

[1704 rows x 6 columns]

In [210]:
data["Year"]

0       1952
1       1957
2       1962
3       1967
4       1972
        ...
1699    1987
1700    1992
1701    1997
1702    2002
1703    2007
Name: Year, Length: 1704, dtype: int64

In [211]:
data.loc[:,"Year"]

0       1952
1       1957
2       1962
3       1967
4       1972
        ...
1699    1987
1700    1992
1701    1997
1702    2002
1703    2007
Name: Year, Length: 1704, dtype: int64

In [214]:
data.head(2)

       Country  Year  Population Continent  Life_Expl     gdp_cap
0  Afghanistan  1952     8425333      Asia     28.801  779.445314
1  Afghanistan  1957     9240934      Asia     30.332  820.853030

In [216]:
data.T.drop_duplicates(keep = "first")

,0,1,2,3,4,5,6,7,8,9,...,1694,1695,1696,1697,1698,1699,1700,1701,1702,1703
Country,Afghanistan,Afghanistan,Afghanistan,Afghanistan,Afghanistan,Afghanistan,Afghanistan,Afghanistan,Afghanistan,Afghanistan,...,Zimbabwe,Zimbabwe,Zimbabwe,Zimbabwe,Zimbabwe,Zimbabwe,Zimbabwe,Zimbabwe,Zimbabwe,Zimbabwe
Year,1952,1957,1962,1967,1972,1977,1982,1987,1992,1997,...,1962,1967,1972,1977,1982,1987,1992,1997,2002,2007
Population,8425333,9240934,10267083,11537966,13079460,14880372,12881816,13867957,16317921,22227415,...,4277736,4995432,5861135,6642107,7636524,9216418,10704340,11404948,11926563,12311143
Continent,Asia,Asia,Asia,Asia,Asia,Asia,Asia,Asia,Asia,Asia,...,Africa,Africa,Africa,Africa,Africa,Africa,Africa,Africa,Africa,Africa
Life_Expl,28.801,30.332,31.997,34.02,36.088,38.438,39.854,40.822,41.674,41.763,...,52.358,53.995,55.635,57.674,60.363,62.351,60.377,46.809,39.989,43.487
gdp_cap,779.445314,820.85303,853.10071,836.197138,739.981106,786.11336,978.011439,852.395945,649.341395,635.341351,...,527.272182,569.795071,799.362176,685.587682,788.855041,706.157306,693.420786,792.44996,672.038623,469.709298

In [217]:
df = pd.DataFrame([[1, 2], ["Ram", "Shyam"], ["IT", "Ops"]], columns = ["emp_id", "name", "dept"])

ValueError: 3 columns passed, passed data had 2 columns

In [218]:
df = pd.DataFrame([[1, "Ram", "IT"], [2, "Shyam", "Ops"]], columns = ["emp_id", "name", "dept"])

In [222]:
df = pd.DataFrame([1, "Ram", "IT"], columns = ["emp_id", "name", "dept"])

ValueError: Shape of passed values is (3, 1), indices imply (3, 3)

In [221]:
df = pd.DataFrame({'emp_id':[1, 2], 'name': ['Ram', 'Shyam'], 'dept':['IT', 'Ops']})